; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-95)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 - object)
 (:init 
    (arm-empty)
    (clear b28)
    (on b28 b2)
    (on b2 b22)
    (on b22 b13)
    (on b13 b1)
    (on b1 b14)
    (on b14 b11)
    (on b11 b5)
    (on b5 b26)
    (on-table b26)
    (clear b24)
    (on b24 b16)
    (on b16 b27)
    (on b27 b9)
    (on b9 b18)
    (on b18 b23)
    (on b23 b21)
    (on b21 b25)
    (on b25 b4)
    (on b4 b6)
    (on b6 b19)
    (on b19 b15)
    (on-table b15)
    (clear b8)
    (on-table b8)
    (clear b12)
    (on b12 b3)
    (on b3 b10)
    (on b10 b20)
    (on b20 b7)
    (on b7 b17)
    (on-table b17))
 (:goal (and 
(on-table b17)
(on b13 b24)
))
)

; plan
1. (unstack b28 b2)
   deleted: (on b28 b2) (clear b28) (arm-empty)
   added: (holding b28) (clear b2)
   goals met: 1 of 2
2. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 2
3. (unstack b2 b22)
   deleted: (on b2 b22) (clear b2) (arm-empty)
   added: (holding b2) (clear b22)
   goals met: 1 of 2
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 2
5. (unstack b22 b13)
   deleted: (on b22 b13) (clear b22) (arm-empty)
   added: (holding b22) (clear b13)
   goals met: 1 of 2
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 2
7. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 2
8. (stack b13 b24)
   deleted: (clear b24) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b24)
   goals met: 2 of 2
